###############################################################################
# 没有做对多平台的判断，就是要求linux(or mac) + gcc
# 
# author yulongli
###############################################################################


###############################################################################
#开发环境的定义  
CC      = gcc
CXX     = g++
AR      = ar
RM      = rm -f
################################################################################
C_FLAGS    = -Wall -Werror -O 
################################################################################
CC_FLAGS   = $(C_FLAGS)
################################################################################
DEBUGFLAGS = -g -DDEBUG
DEBUG_FLAG = 0
#########################################



CPP   = $(wildcard ./src/*.cpp)
OBJ   = $(patsubst ./src/%.cpp, ./.obj/%.o, $(CPP))


ALLINC	= ./include/
INC         = $(patsubst %,-I%,$(ALLINC)) 



out	= libxcode.a
#得到CPP/OBJ文件的名称
ALLCCPP   = $(wildcard ./*.cpp )
ALLOBJ   = $(patsubst ./%.cpp, ./.obj/%.o, $(ALLCCPP))


.obj/%.o : ./src/%.cpp
	$(CXX) $(INC) -c $(CC_FLAGS) $< -o	$@


all:$(out)
$(out):$(OBJ) 
	$(AR) rc $(out)	$(OBJ)
	cp $(out) ./lib

clean:
	$(RM) $(out) 


